In [1]:
#All the imports
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
import numpy as np
import pandas as pd
import seaborn as sns
from google.colab import files

import tensorflow as tf
import keras_preprocessing
from keras_preprocessing import image
from tensorflow.keras import layers
from tensorflow.keras import Model
from tensorflow.keras.layers.experimental import preprocessing
from tensorflow.keras.optimizers import RMSprop, Adam
from sklearn.model_selection import train_test_split

#-----------Other-----------
# Make numpy printouts easier to read.
np.set_printoptions(precision=3, suppress=True)

#IO for the files
import io

#Clear output
from IPython.display import clear_output

In [74]:
putout_data = pd.read_csv("putout.csv", na_values="NaN")

In [75]:
#Only get the actual necessary columns
putout_data = putout_data[['latitude', 'longitude', 'putout_time', 'discovery_month', 'Vegetation', 'Temp_pre_7']]
putout_data.head()

    latitude   longitude  ... Vegetation Temp_pre_7
0  18.105072  -66.753044  ...         12  24.902597
1  35.038330  -87.610000  ...         15   0.343529
2  34.947800  -88.722500  ...         16   5.558750
3  39.641400 -119.308300  ...          0  18.142564
4  30.700600  -90.591400  ...         12  -1.000000

[5 rows x 6 columns]

In [76]:
# Drop NA stuff
putout_data = putout_data.dropna()
putout_data.head()

        latitude   longitude  ... Vegetation Temp_pre_7
3      39.641400 -119.308300  ...          0  18.142564
9      48.839400  -99.718500  ...         15   6.053333
11     31.195108  -88.150651  ...         12  -1.000000
14     32.775000  -80.658333  ...         12  -1.000000
22     40.843386  -73.316419  ...         15  -1.000000
...          ...         ...  ...        ...        ...
55350  30.400883 -101.331933  ...         12  30.543452
55351  45.922100 -111.422500  ...         15  10.420339
55352  48.937900 -119.309100  ...         15  24.363529
55363  38.342719 -120.695967  ...          0  -1.000000
55365  40.604300 -123.080450  ...         15  -1.000000

[27477 rows x 6 columns]

In [77]:
# Putout conversion
putout_data['putout_time'] = putout_data['putout_time'].str.split(' ').str[0]
putout_data['putout_time']

3          0
9          0
11         0
14         0
22         0
        ...
55350      2
55351      5
55352    140
55363     22
55365     43
Name: putout_time, Length: 27477, dtype: object

In [79]:
# Discover month conversion
putout_data['discovery_month'] = putout_data['discovery_month'].map({'Jan': 1, 'Feb': 2, 'Mar': 3, 'Apr': 4, 'May': 5, 'Jun': 6, 'Jul': 7, 'Aug': 8, 'Sep': 9, 'Oct': 10, 'Nov': 11, 'Dec': 12 })
putout_data['discovery_month']

        latitude   longitude  ... Vegetation  Temp_pre_7
3      39.641400 -119.308300  ...          0   18.142564
9      48.839400  -99.718500  ...         15    6.053333
11     31.195108  -88.150651  ...         12   -1.000000
14     32.775000  -80.658333  ...         12   -1.000000
22     40.843386  -73.316419  ...         15   -1.000000
...          ...         ...  ...        ...         ...
55350  30.400883 -101.331933  ...         12   30.543452
55351  45.922100 -111.422500  ...         15   10.420339
55352  48.937900 -119.309100  ...         15   24.363529
55363  38.342719 -120.695967  ...          0   -1.000000
55365  40.604300 -123.080450  ...         15   -1.000000

[27477 rows x 6 columns]